Repository: salamzadeh/pb_authenticator
Catalog: lib/l10n/app_*.arb
Languages: fa

# appName
source: PB Authenticator
fa: پی‌بی احرازگر

source: OK
fa: تأیید

source: Yes
fa: بله

source: No
fa: خیر

source: Error
fa: خطا

source: Save
fa: ذخیره

source: Edit
fa: ویرایش

source: Add
fa: افزودن

# addTitle
source: Add Account
fa: افزودن حساب

# addScanQR
source: Scan QR Code
fa: اسکن کد QR

# addManualInput
source: Manual Input
fa: ورود دستی

# addMethodPrompt
source: Please select input method.
fa: لطفاً روش ورود را انتخاب کنید.

source: Cancel
fa: انصراف

# secret
source: Secret key
fa: کلید مخفی

# secretInvalidMessage
source: Secret key is invalid
fa: کلید مخفی نامعتبر است

# issuer
source: Provider/Issuer
fa: ارائه‌دهنده/صادرکننده

source: Account Name
fa: نام حساب

# digits
source: Number of digits
fa: تعداد ارقام

# period
source: Time step
fa: گام زمانی

# settingsTitle
source: Settings
fa: تنظیمات

# source
source: Source code
fa: کد منبع

# clipboard
source: Copied to clipboard
fa: در کلیپ‌بورد کپی شد

# noAccounts
source: You have no accounts, press the + button to add one.
fa: شما هیچ حسابی ندارید، برای افزودن یک حساب دکمه + را فشار دهید.

source: Loading...
fa: در حال بارگذاری...

# editTitle
source: Edit Accounts
fa: ویرایش حساب‌ها

source: Remove accounts
fa: حذف حساب‌ها

# removeConfirmation
source: Please do not forget to turn off 2 factor authentication before removal. Are you sure that you want to remove the selected account(s)?
fa: لطفاً قبل از حذف، احراز هویت دو مرحله‌ای را غیرفعال کنید. آیا مطمئن هستید که می‌خواهید حساب(های) انتخاب شده را حذف کنید؟

# exitEditTitle
source: Exit
fa: خروج

# exitEditInfo
source: Do you want to exit edit mode without saving?
fa: آیا می‌خواهید بدون ذخیره از حالت ویرایش خارج شوید؟

# errDuplicateAccount
source: Duplicate account
fa: حساب تکراری

# errIdCollision
source: A rare ID collision has occurred. Please try again.
fa: یک برخورد نادر شناسه رخ داده است. لطفاً دوباره تلاش کنید.

# errNoCameraPermission
source: Camera permission not granted
fa: دسترسی دوربین داده نشده است

# errIncorrectFormat
source: Scanned code is of incorrect format
fa: کد اسکن شده فرمت نادرست دارد

# errUnknown
source: Unknown error
fa: خطای ناشناخته

# howItWorksTitle
source: How it works
fa: نحوه کارکرد

# howItWorksTitle1
source: Secure your accounts
fa: حساب‌های خود را ایمن کنید

# howItWorksBody1
source: Add your accounts to generate time-based one-time passwords (TOTP) for secure sign-in.
fa: حساب‌های خود را اضافه کنید تا رمزهای یکبار مصرف مبتنی بر زمان (TOTP) برای ورود امن تولید کنید.

# howItWorksTitle2
source: Scan QR codes
fa: اسکن کدهای QR

# howItWorksBody2
source: Easily add new accounts by scanning QR codes provided by your services.
fa: به راحتی با اسکن کدهای QR ارائه شده توسط سرویس‌ها، حساب جدید اضافه کنید.

# howItWorksTitle3
source: Backup & Restore
fa: پشتیبان‌گیری و بازیابی

# howItWorksBody3
source: Backup your accounts securely and restore them when needed.
fa: حساب‌های خود را به صورت امن پشتیبان‌گیری و در صورت نیاز بازیابی کنید.

# howItWorksTitle4
source: Offline & Private
fa: آفلاین و خصوصی

# howItWorksBody4
source: All data stays on your device. No internet required for generating codes.
fa: تمام داده‌ها روی دستگاه شما باقی می‌ماند. برای تولید کدها نیازی به اینترنت نیست.

source: Skip
fa: رد کردن

source: Done
fa: انجام شد

# transferCodesTitle
source: Transfer codes
fa: انتقال کدها

# transferCodesDescription
source: Transfer your accounts to another device.
fa: حساب‌های خود را به دستگاه دیگری منتقل کنید.

source: Export accounts
fa: خروجی گرفتن از حساب‌ها

source: Import accounts
fa: وارد کردن حساب‌ها

# importSuccess
source: Accounts imported successfully!
fa: حساب‌ها با موفقیت وارد شدند!

# importDescription
source: Import your accounts from Google Authenticator or PB Authenticator by scanning a QR code.
fa: حساب‌های خود را از Google Authenticator یا PB Authenticator با اسکن کد QR وارد کنید.
